site.org
#+title: Random bits and pieces
#+subtitle: ...about programming, languages, tools, FLOSS software...
#+author: Igor Dejanović
#+hugo_base_dir: .
#+hugo_section: /
#+options: creator:t author:nil

*** Информације за пројекат
:PROPERTIES:
:EXPORT_FILE_NAME: projekat
:END:
**** Teme
- Predloženi projekti moraju biti bazirani na textX ili parglare bibliotekama.
- Mogu biti JSD implementacije ili unapređenja pomenutih biblioteka.
- Jezici mogu da definišu i podršku za editore (code completion, syntax
  highlighting itd. za npr. VS Code) -- poželjno posebno kod većih timova.
  Videti projekte [[https://github.com/textX/textX-LS][textX-LS]] i [[https://microsoft.github.io/language-server-protocol/][Language Server Protocol]].

**** O vođenju projekta
- Svi projekti moraju biti otvorenog koda javno hostovani na GitHub-u. Izbor
  licence se ostavlja članovima tima, ali mora biti [[https://opensource.org/licenses][OSI odobrena]].
- Predlog se piše u README fajlu projekta i šalje se link predmetnom profesoru
  na odobrenje.
- Zadaci na projektu se definišu u sklopu [[https://github.com/features/issues/][GitHub issues]].
- Tekuće stanje se prati upotrebom [[https://docs.github.com/en/issues/organizing-your-work-with-project-boards/managing-project-boards/about-project-boards][Kanban table]].

**** Potrebno proveriti pre slanja profesoru na pregled
- Projekat može da se instalira u modu za razvoj sa =pip install -e=.
  - Da bi ovo bilo moguće projekat mora imati =setup.py= odnosno =setup.cfg= sa
    validnim meta-podacima.
  - Proverite da li =python setup.py bdist_wheel= pakuje sve potrebne fajlove u
    rezultujći wheel fajl.
  - Ukoliko se ispravno podesi projekat je moguće instalirati u virtuelno
    okruženje upotrebom pip komande direktno iz git repozitorijuma. Na primer:
    #+begin_src sh
    pip install git+https://github.com/textX/textX.git
    #+end_src
  - Za dodatne informacije pogledati [[https://packaging.python.org/en/latest/guides/distributing-packages-using-setuptools/][Python uputstvo za pakovanje i distribuciju
    projekata]].

- Svi textX jezici i generatori su registrovani na odgovarajući način u
  =setup.cfg= i dostupni =textx= komandi. Vidite [[http://textx.github.io/textX/stable/registration/][textX registraciju i otkrivanje]].
  Kao primer videti [[https://github.com/textX/textX/blob/master/setup.cfg][sam textX projekat]].

  Generatori se mogu pozvati sa:
  #+begin_src sh
  textx generate ...
  #+end_src

- README.md mora da sardži opis projekta, uputstvo za instalaciju i primer
  upotrebe. Jezik može biti srpski ili engleski ali mora biti konzistentno
  korišćen.
